trinhlehoang1999/py_stm32_serial/KEILC_IOT/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TX_USB_Pin GPIO_PIN_2
#define TX_USB_GPIO_Port GPIOA
#define RX_USB_Pin GPIO_PIN_3
#define RX_USB_GPIO_Port GPIOA
#define BT1_Pin GPIO_PIN_10
#define BT1_GPIO_Port GPIOB
#define BT1_EXTI_IRQn EXTI15_10_IRQn
#define BT2_Pin GPIO_PIN_11
#define BT2_GPIO_Port GPIOB
#define BT2_EXTI_IRQn EXTI15_10_IRQn
#define RELAY1_Pin GPIO_PIN_14
#define RELAY1_GPIO_Port GPIOB
#define RELAY2_Pin GPIO_PIN_15
#define RELAY2_GPIO_Port GPIOB
#define RX_ESP_Pin GPIO_PIN_9
#define RX_ESP_GPIO_Port GPIOA
#define TX_ESP_Pin GPIO_PIN_10
#define TX_ESP_GPIO_Port GPIOA
#define ENB_ESP_Pin GPIO_PIN_11
#define ENB_ESP_GPIO_Port GPIOA
#define LED1_Pin GPIO_PIN_3
#define LED1_GPIO_Port GPIOB
#define LED2_Pin GPIO_PIN_4
#define LED2_GPIO_Port GPIOB
#define LED3_Pin GPIO_PIN_5
#define LED3_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
